Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint must be replaced
-/+ resource "aws_ses_identity_notification_topic" "complaint" {
      ~ id                       = "no.reply.gaspi.notifications@gmail.com|Complaint" -> (known after apply)
      ~ identity                 = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery must be replaced
-/+ resource "aws_ses_identity_notification_topic" "delivery" {
      ~ id                       = "no.reply.gaspi.notifications@gmail.com|Delivery" -> (known after apply)
      ~ identity                 = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.gaspifs.null_resource.gaspifs-upload will be created
  + resource "null_resource" "gaspifs-upload" {
      + id       = (known after apply)
      + triggers = {
          + "cargo_lock_hash"  = "995e1eb171238ec751da3c1d3a32387dfe4ccb9f"
          + "cargo_toml_hash"  = "465eadc0bfe3b774a527baf84772f158bec989ed"
          + "docker_file_hash" = "a20d1ec7ca803881a0e501bb2d176e636409a8c3"
          + "source_hash"      = "cf4a361237609d6aaadccf79ead79e97d4bf5608"
        }
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62" -> (known after apply)
      ~ code_sha256                 = "YCAr90Tfdqmjil8ene4JincX4s5Bn/UeawH9UP/BfV8=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T04:00:35.004+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "RkT3IIDRspTrCh/tYv0LmtOJ03sIr3OcWww6zDx4PUBBRVjzHpFeez+fK0ghgTp1xCNhgsMgCYRfm7AGj7dnTQ==" -> "So+tQIGyOXv36Wtq2KoMEAT749Yzv6cx/rqEraarAHB6lgEoBkPD3asJmM/NHPXoKV6WW0L/4BfSw4jFL7FH2w==" # forces replacement
      ~ source_code_size            = 18449730 -> (known after apply)
      ~ version                     = "62" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal-20250725041402702700000001"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:57" -> (known after apply)
      ~ code_sha256                 = "bQSTbkqTmnpavpQS3OL3SWIZ8QntO4G/1cIzNMxJ13Y=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-10-02T09:46:38.626+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:57" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "Ru84te7hPeNx4OYtEbgj0UsR0HOVrL2gxmonp+EYsZ0Ig/YlNn+OEyM9rE6VFt0hFmB1bgxAmpe5f7LT0/qMeA==" -> "SGvOu/J3OUhpjIyNU/WUQygY7a/4sNNLbYShPjbsW6tKkJnKeNtdGiFy46jP+Udr6dSJ9AYWeW0X9lEUFi1eYg==" # forces replacement
      ~ source_code_size            = 17636130 -> (known after apply)
      ~ version                     = "57" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer (deposed object 86d7f994) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:56" -> null
      - code_sha256                 = "u0FAKoePYPkRvKGdttMwzEx12+Rf3euGVsIjDQagI48=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-09-25T04:00:37.178+0000" -> null
      - filename                    = "svep/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer:56" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:svep_backend_binaries_layer" -> null
      - layer_name                  = "svep_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "C/+Zm9ZA1VcCev1huOApYtzoL4cfp9Z6dnjPsLqQCekF4Ymd9Sa7dBMIS70jLrWrVwJm1Qc6i0Iuhwdbkp06og==" -> null
      - source_code_size            = 17975924 -> null
      - version                     = "56" -> null
        # (4 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v1.1.0-66-g95fc7391+" -> "v1.1.0-66-g31edd7f5+"
        id                            = "webgui-bucket-20250725041401948400000001/version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = "667754c54205362596e9d467e2b53c5ad450d5d4"
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "caab493802eac5ae99fb1979ad045b4f3c946757"
          + "compiled_code_hash" = "667754c54205362596e9d467e2b53c5ad450d5d4"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be created
  + resource "terraform_data" "cloudfront-version-invalidate" {
      + id               = (known after apply)
      + triggers_replace = [
          + "v1.1.0-66-g31edd7f5+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8641378613222845320" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1738902407886527000" -> "1759400932354036000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object d3f4396e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8733599347357569201" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1758772642459469000"
        } -> null
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4980990984380490677" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950388698911000" -> "1759400932665044000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3326601294250590275" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080896864511000" -> "1759400932427784000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (deposed object c2fa5c90) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5064334270210351654" -> null
      - triggers = {
          - "filename"  = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip"
          - "timestamp" = "1758772642259548000"
        } -> null
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4161800426937857230" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396982762038000" -> "1759400932487502000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (deposed object b08ed707) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "18628520164376909" -> null
      - triggers = {
          - "filename"  = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
          - "timestamp" = "1758772641544395000"
        } -> null
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (30 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"      = "no.reply.gaspi.notifications@gmail.com" -> "dian.larasaty@xapiens.id"
              ~ "SES_TARGET_EMAIL"      = "devops@xapiens.id" -> "brendan.hosking@csiro.au"
                # (5 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7971886947653586413" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1753256441906966000" -> "1759400930274736800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:ff091327c1679e9c3bba200abef28cb3a1a0585ba2bd2050d531670ec15f6b2f307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:ff091327c1679e9c3bba200abef28cb3a1a0585ba2bd2050d531670ec15f6b2f" -> (known after apply)
        name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ repo_digest  = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "8184c611d1fe8f42abd2a1caa54e3866f430f773" -> "4bc057beff66e51f462b1609f23f8289940a507f"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this (deposed object add50e3f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_image" "this" {
      - force_remove = false -> null
      - id           = "sha256:ff091327c1679e9c3bba200abef28cb3a1a0585ba2bd2050d531670ec15f6b2f307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - image_id     = "sha256:ff091327c1679e9c3bba200abef28cb3a1a0585ba2bd2050d531670ec15f6b2f" -> null
      - keep_locally = false -> null
      - name         = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - repo_digest  = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> null
      - triggers     = {
          - "dir_sha" = "9c8a4b0df43bf65bf8ecafefe7886d9763819919"
        } -> null

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "sbeacon/lambda/submitDataset" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> (known after apply)
        name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "8184c611d1fe8f42abd2a1caa54e3866f430f773" -> "4bc057beff66e51f462b1609f23f8289940a507f"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this (deposed object 3aa2f8ed) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:17438717e7dc13d70befad6ff6ad9b9c121fdf2513a4d043d85da7b044b64757" -> null
      - insecure_skip_verify = false -> null
      - keep_remotely        = false -> null
      - name                 = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
      - sha256_digest        = "sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> null
      - triggers             = {
          - "dir_sha" = "9c8a4b0df43bf65bf8ecafefe7886d9763819919"
        } -> null
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.zip" -> "builds/ed3214780eda2fccec801a911fdb277e6dc9e78b895fa50c7a68da0891fad494.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-25T04:01:16.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/ed3214780eda2fccec801a911fdb277e6dc9e78b895fa50c7a68da0891fad494.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/ed3214780eda2fccec801a911fdb277e6dc9e78b895fa50c7a68da0891fad494.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3303304725263522391" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9ed7a3a53893853906a8cb3982a3442b5dae98a49d53a0c7a6e48775a617e148.zip" -> "builds/ed3214780eda2fccec801a911fdb277e6dc9e78b895fa50c7a68da0891fad494.zip"
          ~ "timestamp" = "1758508635926626000" -> "1759400929052080000"
        }
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object 36f76df3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4251781171458302546" -> null
      - triggers = {
          - "filename"  = "builds/30267488a8a4325d2891ba324d9e8abb3c9c7a2b58300dc38534efe432500029.zip"
          - "timestamp" = "1758772642039504000"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.zip" -> "builds/1ebe20738a610620ea106f2b6791bbea1a730ee6328fd3f68f8aed5b0b119843.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-09-25T04:02:33.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/1ebe20738a610620ea106f2b6791bbea1a730ee6328fd3f68f8aed5b0b119843.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/1ebe20738a610620ea106f2b6791bbea1a730ee6328fd3f68f8aed5b0b119843.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7169939710297907087" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a122d8c3b94b28867e80b1b41993e9f8360862b6c3d093aef7f2d3a6b55cdf50.zip" -> "builds/1ebe20738a610620ea106f2b6791bbea1a730ee6328fd3f68f8aed5b0b119843.zip"
          ~ "timestamp" = "1758508635347015000" -> "1759400930233512000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object cf45b3b8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5783150564211343300" -> null
      - triggers = {
          - "filename"  = "builds/8401a682b1c05434cbe81f478429fb959be19d672c5882cbdc4b49802e1e9bda.zip"
          - "timestamp" = "1758772642738376000"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4776867616055728766" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080897719951000" -> "1759400929527407800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (deposed object aa7d109a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "762880543556749851" -> null
      - triggers = {
          - "filename"  = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          - "timestamp" = "1758772642732099000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8231230635083520364" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1745822211927162000" -> "1759400929943608000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object 1e68b0ee) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3856504420988406402" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1758772642730786000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5796087198711564591" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1759398194839871800" -> "1759400930147524200"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object ebbe6aea) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8645090680948945099" -> null
      - triggers = {
          - "filename"  = "builds/ab36e06000e6badb6ecdf9c65c96e0a262966ac7d2af09530c1a1e9121f6657e.zip"
          - "timestamp" = "1758772642664816000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3109183338551128842" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598181234816000" -> "1759400930332856000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object 8231333c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8778071839060724645" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1758772642161426000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2902168622497138930" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180859624000" -> "1759400929335845000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object ce9f899d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7075221295948458167" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1758772642747098000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7910415022977682128" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292518605725000" -> "1759400929720982000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object 28b172ab) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5397657541022046695" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1758772641372600000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.zip" -> "builds/176a452c3d9f880005072f6eb747a1d4b7efde67b0750e0c3a7155875ee4218f.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-09-25T04:01:27.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/getDatasets",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/176a452c3d9f880005072f6eb747a1d4b7efde67b0750e0c3a7155875ee4218f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/176a452c3d9f880005072f6eb747a1d4b7efde67b0750e0c3a7155875ee4218f.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3959059078275309300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/74827b7c33367c85a24bbc7acb24a868b79c62e1bfdcca1014bc6aac52aa0f44.zip" -> "builds/176a452c3d9f880005072f6eb747a1d4b7efde67b0750e0c3a7155875ee4218f.zip"
          ~ "timestamp" = "1751598180850831000" -> "1759400929912205000"
        }
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object d20bd312) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6501036798696594600" -> null
      - triggers = {
          - "filename"  = "builds/eefbe5537b3ebd0ba7a0af876384ce8d4a9f4a883971cc3747abb737ae01e372.zip"
          - "timestamp" = "1758772641327224000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4062559476805587201" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517936575800" -> "1759400929965075000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object a39f71e7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8194662835112669666" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1758772641541150000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6427378035014593009" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1734495186214723200" -> "1759400930210817000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object 4d6cdaa4) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8389621514338253501" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1758772641737706800"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3542083703557394330" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598179837004800" -> "1759400929219534000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object 162f008a) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7342738449649649095" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1758772642454287000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8826876793010481906" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180671036000" -> "1759400930668986000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object e0d6ce64) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8497195440980023630" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1758772642135009000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4429780573307172073" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1737448472789048000" -> "1759400929446398000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object 7a1607ec) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1279820202532516015" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1758772642759720000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2914301757680039990" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1733292517221816000" -> "1759400929138509000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object 840deb1d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1787116801531432443" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1758772641460704000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "2793910197530869042" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1739950386465660000" -> "1759400929041540000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getProjects.null_resource.archive[0] (deposed object 62c1ad3e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1072142489836625989" -> null
      - triggers = {
          - "filename"  = "builds/aa396856c56bc316f5429db8c17f42525a5333058192b85978c8cc8f4bb30bfe.zip"
          - "timestamp" = "1758772641427188000"
        } -> null
    }

  # module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getRuns"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5846507914272431726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751598180250890000" -> "1759400930015984000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-getRuns.null_resource.archive[0] (deposed object e951783b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1261130432718282365" -> null
      - triggers = {
          - "filename"  = "builds/88930b272de54490182522f38fc6eadca926dd71de4ff726cf3de04349617ecc.zip"
          - "timestamp" = "1758772641855863000"
        } -> null
    }

  # module.sbeacon.module.lambda-indexer.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-indexer"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3916160387064965636" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748396983081240800" -> "1759400929516761000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-indexer.null_resource.archive[0] (deposed object e277a3fc) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6068204153736633055" -> null
      - triggers = {
          - "filename"  = "builds/aa624c03dfdae7cc1b6f9061e4ad7e5605e073652e2540f56756ee4171caf5db.zip"
          - "timestamp" = "1758772641724331000"
        } -> null
    }

  # module.sbeacon.module.lambda-performQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-performQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8457966463896351148" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181576398202000" -> "1759400929747485000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-performQuery.null_resource.archive[0] (deposed object f726ab14) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "894996035932817230" -> null
      - triggers = {
          - "filename"  = "builds/ed9c4d15f50553a43a1fbe829043aee893846f7ad048b424e36c5ecf460120d1.zip"
          - "timestamp" = "1758772642330568000"
        } -> null
    }

  # module.sbeacon.module.lambda-splitQuery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-splitQuery"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6265661174575056361" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742181577061003000" -> "1759400929431524000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-splitQuery.null_resource.archive[0] (deposed object 601ecda2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6533098764981217643" -> null
      - triggers = {
          - "filename"  = "builds/76408ab6569b18b2349025a9480461ae075f7db9418cd088256937bb57a8a8ac.zip"
          - "timestamp" = "1758772641778575800"
        } -> null
    }

  # module.sbeacon.module.lambda-submitDataset.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-submitDataset"
      ~ image_uri                      = "307946671795.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers@sha256:d2d48ff759c95ba72ba7e757af4a31e2d89f1144d54768804ed4c92ea1798a14" -> (known after apply)
      ~ last_modified                  = "2025-10-02T09:47:28.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-updateFiles"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_binaries_layer:62",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67",
          - "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_modules_layer:35",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "dev"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1318680988124239804" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758080898092570000" -> "1759400929618256000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] (deposed object 45e5934d) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5516201958327137919" -> null
      - triggers = {
          - "filename"  = "builds/af5bf3b9b67b07d522efa9b0e7ffedcccb023517fee892632475f08f4f7d282c.zip"
          - "timestamp" = "1758772642236996800"
        } -> null
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67" -> (known after apply)
      ~ code_sha256                 = "MiIA97wYySwXRJr4OMHLamGVsf/Mio9+Qst4AqGy+FE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-25T04:01:08.879+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer:67" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:307946671795:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" -> "builds/05f7881ae72a4763c11c32d51aacf01693b71b4385685c58e0e7bb421885cfa3.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 24399143 -> (known after apply)
      ~ version                     = "67" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "8400469b216cefb8ecd790df249eb5b4" -> (known after apply)
      ~ id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" -> (known after apply)
      ~ key                           = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" -> "builds/05f7881ae72a4763c11c32d51aacf01693b71b4385685c58e0e7bb421885cfa3.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/01c3b19e3cc0b4011350293d7d3805d9ef8c3c7f5b4f58165a4e4f015a2c34ed.zip" -> "builds/05f7881ae72a4763c11c32d51aacf01693b71b4385685c58e0e7bb421885cfa3.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object 84ecd7d5) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250725041417117200000004/builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" -> null
      - bucket                        = "gaspi-lambda-layers-20250725041417117200000004" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "binary/octet-stream" -> null
      - etag                          = "8b76ca7799e73c7d045349371e429425-5" -> null
      - force_destroy                 = false -> null
      - id                            = "gaspi-lambda-layers-20250725041417117200000004/builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" -> null
      - key                           = "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/8fafa2527522984ebd57f8292056fca2cf4e603a3f46619118899a9b2b0d1c27.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.